20240504T154953--kdoc-163-セグメンテーションとページングの使い分け__draft_code.org
:properties:
:ID: 20240504T154953
:end:
#+title:      KDOC 163: セグメンテーションとページングの使い分け
#+date:       [2024-05-04 Sat 15:49]
#+filetags:   :draft:code:
#+identifier: 20240504T154953

# (denote-rename-file-using-front-matter (buffer-file-name) 0)
# (save-excursion (while (re-search-backward ":draft" nil t) (replace-match "")))
# (flush-lines "^\\#\s.+?")

# ====ポリシー。
# 1ファイル1アイデア。
# 1ファイルで内容を完結させる。
# 常にほかのエントリとリンクする。
# 自分の言葉を使う。
# 参考文献を残しておく。
# 文献メモの場合は、感想と混ぜないこと。1つのアイデアに反する
# 自分の考えを加える。
# 構造を気にしない。
# エントリ間の接続を発見したら、接続エントリを追加する。カード間にあるリンクの関係を説明するカード。
# アイデアがまとまったらアウトラインエントリを作成する。リンクをまとめたエントリ。
# エントリを削除しない。古いカードのどこが悪いかを説明する新しいカードへのリンクを追加する。
# 恐れずにカードを追加する。無意味の可能性があっても追加しておくことが重要。

* この文書のステータス
- 作成
  - [X] 2024-05-09 貴島
- レビュー
  - [ ] <署名>
# (progn (kill-line -1) (insert (format "  - [X] %s 貴島" (format-time-string "%Y-%m-%d"))))

# 関連をつけた。
# タイトルがフォーマット通りにつけられている。
# 内容をブラウザに表示して読んだ(作成とレビューのチェックは同時にしない)。
# 文脈なく読めるのを確認した。
# おばあちゃんに説明できる。
# いらない見出しを削除した。
# タグを適切にした。
# すべてのコメントを削除した。
* 最近はページングを使うことが多い
メモリのアドレス変換に2つの方式があることを学んだ。どう使い分けるのだろう、と疑問を持った。調べてみて、使い分けというよりは、歴史的な2つの方式であると認識した。セグメンテーションはあまり使われなくなり、今はページングを使うことが多い。

セグメンテーションは連続化したメモリが必要で、解放されているメモリが小さな塊では使えない。そのためデフラグメンテーションという処理で移動が必要。デフラグメンテーションは大量のコピーが必要なので遅い。断片化しすぎる前に定期的に実行する必要がある。

x86の64bitモードではセグメンテーションをサポートしていない。ほとんどのシステムでセグメンテーションが用いられなくなった理由の1つに断片化の問題がある。ページングによって断片化の問題を回避できる。

* 参考
- [[https://os.phil-opp.com/ja/paging-introduction/][ページング入門 | Writing an OS in Rust]]

* 関連
- [[id:20240427T113714][KDOC 140: 『自作エミュレータで学ぶx86アーキテクチャ』]]。本を読んで考えたこと
- [[id:20240504T154649][KDOC 162: セグメンテーションとページングの違い]]。まず違いを調べた
