20240504T154953--kdoc-163-セグメンテーションとページングの使い分け__draft_code.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2024-05-09 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>KDOC 163: セグメンテーションとページングの使い分け</title>
<meta name="generator" content="Org mode">
<meta name="author" content="root">
<link rel='shortcut icon' type='image/x-icon' href='/roam/favicon.ico' /><link rel='stylesheet' href='https://cdn.jsdelivr.net/npm/bootstrap@5.0.2/dist/css/bootstrap.min.css' /><link rel='stylesheet' href='https://cdnjs.cloudflare.com/ajax/libs/font-awesome/5.15.4/css/all.min.css' /><link rel='stylesheet' href='../css/site.css' /><link rel='stylesheet' href='../roam/css/code.css' /><link rel='stylesheet' href='css/site.css' /><link rel='stylesheet' href='css/code.css' />
</head>
<body>
<div id="preamble" class="status">
<div><div class="header"><div class="container"><div class="row"><div class="col-sm-12 col-md-12"><nav class="navbar navbar-light"/></div></div></div></div></div>
</div>
<div id="content">
<h1 class="title">KDOC 163: セグメンテーションとページングの使い分け</h1>

<div id="outline-container-org1e1c36b" class="outline-2">
<h2 id="org1e1c36b"><a href="#org1e1c36b">この文書のステータス</a></h2>
<div class="outline-text-2" id="text-org1e1c36b">
<ul class="org-ul">
<li>作成
<ul class="org-ul">
<li class="off"><input type='checkbox' /> &lt;署名&gt;</li>
</ul></li>
</ul>

<ul class="org-ul">
<li>レビュー
<ul class="org-ul">
<li class="off"><input type='checkbox' /> &lt;署名&gt;</li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-org40d74a1" class="outline-2">
<h2 id="org40d74a1"><a href="#org40d74a1">今はページングを使うことが多い</a></h2>
<div class="outline-text-2" id="text-org40d74a1">
<p>
メモリのアドレス変換に2つの方式があることを学んだ。どう使い分けるのだろう、と疑問を持った。調べてみて、使い分けというよりは、歴史的な2つの方式であると認識した。セグメンテーションはあまり使われなくなり、今はページングを使うことが多い。
</p>

<p>
セグメンテーションは連続化したメモリが必要で、解放されているメモリが小さな塊では使えない。そのためデフラグメンテーションという処理で移動が必要。デフラグメンテーションは大量のコピーが必要なので遅い。断片化しすぎる前に定期的に実行する必要がある。
</p>

<p>
x86の64bitモードではセグメンテーションをサポートしていない。ほとんどのシステムでセグメンテーションが用いられなくなった理由の1つに断片化の問題がある。ページングによって断片化の問題を回避できる。
</p>
</div>
</div>

<div id="outline-container-orge57302a" class="outline-2">
<h2 id="orge57302a"><a href="#orge57302a">参考</a></h2>
<div class="outline-text-2" id="text-orge57302a">
<ul class="org-ul">
<li><a href="https://os.phil-opp.com/ja/paging-introduction/">ページング入門 | Writing an OS in Rust</a></li>
<li><a href="20240427T113714--kdoc-140-『自作エミュレータで学ぶx86アーキテクチャ』__draft_book.html#ID-20240427T113714">KDOC 140: 『自作エミュレータで学ぶx86アーキテクチャ』</a></li>
</ul>
</div>
</div>

<div id="outline-container-org0b33eb3" class="outline-2">
<h2 id="org0b33eb3"><a href="#org0b33eb3">関連</a></h2>
<div class="outline-text-2" id="text-org0b33eb3">
<ul class="org-ul">
<li><a href="20240427T113714--kdoc-140-『自作エミュレータで学ぶx86アーキテクチャ』__draft_book.html#ID-20240427T113714">KDOC 140: 『自作エミュレータで学ぶx86アーキテクチャ』</a>。読んで考えたこと</li>
<li><a href="20240504T154649--kdoc-162-セグメンテーションとページングの違い__draft_code.html#ID-20240504T154649">KDOC 162: セグメンテーションとページングの違い</a>。まず違いを調べた</li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">
<footer class="footer py-3"><div class="container"><div class="row "><div class="col-md-4"></div><div class="col-sm col-md"><nav class="navbar"><a class="nav-link text-secondary small px-0" href="./index.html">Insomnia</a><a class="nav-link text-secondary small px-0" href="./sitemap.html">Sitemap</a><a class="nav-link text-secondary small px-0" href="https://github.com/kijimaD/roam">Repository</a><a class="nav-link text-secondary small px-0" href="https://github.com/kijimaD">@kijimaD</a></nav></div><div class="col-md-4"></div></div></div></footer><script src="https://cdn.jsdelivr.net/npm/bootstrap@5.0.2/dist/js/bootstrap.bundle.min.js"/>
</div>
</body>
</html>
